
let teashop = {
    လက်ဖတ်ရည်: ['ချို့ဆိမ့်', 'ကျဆိမ့်', 'ပုံမှန်'],
    နံနက်ခင်းအစားအစာ: ['နန်းကြီးသုပ်', 'အီကြာကွေး', 'ပေါက်စီ'],
    အအေးသောက်စရာများ: ['ကိုလာ', 'စတင်း', 'သံပရာ']
}

let order = (one, call_work)=> {
    setTimeout (()=> {
        console.log(`အကိုမှာ ထားတဲ့ ${teashop.လက်ဖတ်ရည်[one]} ရပါပီ`);
        call_work();
    }, 1500)
}

let work = ()=> {
    setTimeout(() => {
        console.log('အခုသောက်လိုက်တော့နော်')

        setTimeout(() => {
            console.log("အခုလိုအားပေးတဲ့ အတွက် ကျေးဇူးပါ၊ ခေတ္တစောင့်ပါ")

            setTimeout(() => {
                console.log(`${teashop.နံနက်ခင်းအစားအစာ[1]} ၂ ပွဲ`)

                setTimeout(() => {
                    console.log(`${teashop.အအေးသောက်စရာများ[0]} ၃ ခွက် `)

                    setTimeout(() => {
                        console.log("အားပေးတဲ့ အတွက် ကျေးဇူးပါ မကြာခင် ပြန်တွေ့ကျမယ်နော့်")
                    }, 1000)
                }, 1000)
            }, 1000)
        }, 1000)
    }, 0)
}
order(1, work);





