// အာရုံဆွမ်း
// စာကျက်
// နေ့ဆွမ်း
// ဘုရားဝတ်တက်


function အာရုံဆွမ်း(cb){
    setTimeout(()=>{
        console.log("အာရူံဆွမ်းစားပြီးပါပီ")
        cb();
    }, 1500)
}

function စာကျက်(cb){
    setTimeout(()=>{
        console.log("စာကျက်လို့ပြီးပါပြီ")
        cb();
    }, 2000)
}

function နေ့ဆွမ်း(cb){
    setTimeout(()=>{
        console.log("နေ့ဆွမ်းစားပြီးပါပီ")
        cb();
    }, 2500)
}

function ဘုရားဝတ်တက်(cb){
    setTimeout(()=>{
        console.log("ဘုရားဝတ်တက်ပြီးပါပြီ")
        cb();
    }, 3000)
}
အာရုံဆွမ်း(()=> {
    စာကျက်(() =>{
        နေ့ဆွမ်း(()=>{
            ဘုရားဝတ်တက်(()=>{
                console.log("ယနေ့ကိစ္စအားလုံးအစဥ်ပြေပါတယ်")
            })
        })
    })
})


